/* ----------------------------------------------------*/
/*Имя:Артемьев Кирилл Сергеевич, ПВБО-01-24*/
/*ИМЯ ФАЙЛА: prog.c */
/*НАЗНАЧЕНИЕ ПРОГРАММЫ Обработка ввода и вывод в консоль*/
/*Пользователь вводит цифру (1 или 2) и получает одно из двух приветствий,
в проограмме есть обработка ошибок ввода*/
/* ----------------------------------------------------*/

#include <stdio.h>

int main()
{
    int option = 0;
    printf("Выбери приветствие: напиши 1 или 2 в консоль\n");
    option = InputScan();
    if (option == 1 || option == 2)
    {
        if (option == 1)
        {
            printf("Привет, как успехи в учёбе?\n");
        }
        else if (option == 2)
        {
            printf("Привет, как жизнь?\n");
        }
    }
    else
    {
        printf("Ты ввёл неправильный символ, вводи 1 или 2 в консоль!\n");
    }
    return 0;
}
